/* ──────────────────────────────────────────────── *
│  Проверка того, как компилятор генерирует адрес  │
│  переменной с константным индексом, размножает   │
│  копии и регистры                                │
* ──────────────────────────────────────────────── */

int i2;
int ivector[ 3 ];

int main( argc, argv )
     int argc;
     char **argv;
{
    ivector[ 0 ] = 1;   /* генерация константного адреса */
    ivector[ i2 ] = 2;  /* значение i2 должно быть скопировано */
    ivector[ i2 ] = 2;  /* копирование регистров, дублирующая запись */
    ivector[ 2 ] = 3;   /* генерация константного адреса */

    return ivector[0];
}
